src/InformationRegisters/ЗаданияКОтражениюВБюджетировании/ЗаданияКОтражениюВБюджетировании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаданияКОтражениюВБюджетировании</name>
  <comment>Технический регистр, содержит в себе данные о документах, которые необходимо отразить в бюджетировании</comment>
  <resources>
    <name>ИмяВидаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НомерЗадания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ПравилаПолученияФактаПоСтатьямБюджетов/ПравилаПолученияФактаПоСтатьямБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаПолученияФактаПоСтатьямБюджетов</name>
  <attributes>
    <name>КомпоновщикНастроек</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОтбора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипИтога</name>
    <type>
      <types>EnumRef.ТипыИтогов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотПоАналитикеРасхода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаИсточникаДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширенныйРежимНастройкиЗаполненияАналитики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыражениеЗаполненияАналитики1</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыражениеЗаполненияАналитики2</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыражениеЗаполненияАналитики3</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыражениеЗаполненияАналитики4</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыражениеЗаполненияАналитики5</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыражениеЗаполненияАналитики6</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьУказаннымЗначениемАналитику1</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьУказаннымЗначениемАналитику2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьУказаннымЗначениемАналитику3</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьУказаннымЗначениемАналитику4</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьУказаннымЗначениемАналитику5</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьУказаннымЗначениемАналитику6</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАналитики1</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАналитики2</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАналитики3</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАналитики4</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАналитики5</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАналитики6</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПромежуточноеКэшированиеРезультатовРаботыПравил</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтключитьПравило</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяБюджетов</name>
    <type>
      <types>CatalogRef.СтатьиБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникДанных</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
      <types>String</types>
      <types>CatalogRef.НастройкиХозяйственныхОпераций</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникСуммыОперации</name>
    <type>
      <types>EnumRef.ПоказателиАналитическихРегистров</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСчет</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделИсточникаДанных</name>
    <type>
      <types>EnumRef.РазделыИсточниковДанныхБюджетирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПравила</name>
    <type>
      <types>EnumRef.ТипПравилаПолученияФактическихДанныхБюджетирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешНастроек</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешСхемыКомпоновкиДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыражениеЗаполненияАналитики1ИсторияПереходаНаНовыеФормулы</name>
    <comment>Значение формулы до перехода на новый формат либо первое значение формулы введенное после перехода</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыражениеЗаполненияАналитики2ИсторияПереходаНаНовыеФормулы</name>
    <comment>Значение формулы до перехода на новый формат либо первое значение формулы введенное после перехода</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыражениеЗаполненияАналитики3ИсторияПереходаНаНовыеФормулы</name>
    <comment>Значение формулы до перехода на новый формат либо первое значение формулы введенное после перехода</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыражениеЗаполненияАналитики4ИсторияПереходаНаНовыеФормулы</name>
    <comment>Значение формулы до перехода на новый формат либо первое значение формулы введенное после перехода</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыражениеЗаполненияАналитики5ИсторияПереходаНаНовыеФормулы</name>
    <comment>Значение формулы до перехода на новый формат либо первое значение формулы введенное после перехода</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыражениеЗаполненияАналитики6ИсторияПереходаНаНовыеФормулы</name>
    <comment>Значение формулы до перехода на новый формат либо первое значение формулы введенное после перехода</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланСчетовМеждународногоУчета</name>
    <type>
      <types>CatalogRef.ПланыСчетовМеждународногоУчета</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/ЗаданияКОтражениюВБюджетировании/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Функция определяет требуется ли отразить факт в бюджетировании при формировании отчета.
//
// Параметры:
//  НачалоПериода  - Дата - Необязательный, начало периода.
//  КонецПериода  - Дата - Необязательный, окончание периода.
//  КоличествоНеактуальныхДокументов  - Число - В параметр сохраняется количество документов для отражения факта.
//  ВсегдаАктуализировать - Булево - Необязательный. Если истина, то функция выполняется всегда,
//							если ложь, то проверяется константа АктуализироватьФактБюджетированияПриФормированииОтчетов.								     
//
// Возвращаемое значение:
//   Булево - Признак, что требуется отразить факт в бюджетировании при формировании отчета. 
//
Функция ТребуетсяОтражениеВБюджетированииДляОтчетаЗаПериод(Знач НачалоПериода = Неопределено, Знач КонецПериода = Неопределено, 
															КоличествоНеактуальныхДокументов = 0, ВсегдаАктуализировать = Ложь, ИменаВидовДокументов = Неопределено) Экспорт
															
	Если Не ВсегдаАктуализировать Тогда
		Если Не Константы.АктуализироватьФактБюджетированияПриФормированииОтчетов.Получить() Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Если ИменаВидовДокументов = Неопределено Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПравилаПолученияФактаПоСтатьямБюджетов.Ссылка
		|ИЗ
		|	Справочник.ПравилаПолученияФактаПоСтатьямБюджетов КАК ПравилаПолученияФактаПоСтатьямБюджетов
		|ГДЕ
		|	ПравилаПолученияФактаПоСтатьямБюджетов.ПромежуточноеКэшированиеРезультатовРаботыПравил
		|	И НЕ ПравилаПолученияФактаПоСтатьямБюджетов.ПометкаУдаления";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Если Не ЗначениеЗаполнено(НачалоПериода) Тогда
		НачалоПериода = Дата(1,1,1);
	КонецЕсли;

	Если Не ЗначениеЗаполнено(КонецПериода) Тогда
		КонецПериода = Дата(3999, 12, 31, 23, 59, 59);
	КонецЕсли;
	
	ФактическиеДанныеБюджетированияСервер.ПоместитьДокументыДляОтраженияВоВременнуюТаблицу(НачалоПериода, КонецПериода, МенеджерВременныхТаблиц, ИменаВидовДокументов);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВсеДокументыКОтражению.Документ) КАК Количество
	|ИЗ
	|	ДокументыКОтражению КАК ВсеДокументыКОтражению";
		
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		КоличествоНеактуальныхДокументов = 0;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		КоличествоНеактуальныхДокументов = Выборка.Количество;
	КонецЕсли;
	
	Возврат КоличествоНеактуальныхДокументов > 0;
	
КонецФункции


#Область ОбновлениеИнформационнойБазы

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
//  Обработчики - См. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.1.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_1_0_0";
//  Обработчик.МонопольныйРежим    = Ложь;
//
// Параметры:
// 	Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РегистрыСведений.ЗаданияКОтражениюВБюджетировании.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "2.5.14.17";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("efa80345-df9c-4eb9-a49d-a05b26a19acb");
	Обработчик.Многопоточный = Ложь;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыСведений.ЗаданияКОтражениюВБюджетировании.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Порядок = Перечисления.ПорядокОбработчиковОбновления.Некритичный;
	Обработчик.Комментарий = НСтр("ru = 'Удаление записей по документам ""(не используется) Регистратор договора с поставщиком (соглашения с поставщиком)""';
									|en = 'Delete records by the ""(not used) Contract with vendor (terms of purchase) recorder"" documents'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.РегистрыСведений.ЗаданияКОтражениюВБюджетировании.ПолноеИмя());

	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.РегистрыСведений.ЗаданияКОтражениюВБюджетировании.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Блокируемые = Новый Массив;
	Блокируемые.Добавить(Метаданные.РегистрыСведений.ЗаданияКОтражениюВБюджетировании.ПолноеИмя());
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");
	
КонецПроцедуры

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаданияКОтражениюВБюджетировании.Документ КАК Документ
		|ИЗ
		|	РегистрСведений.ЗаданияКОтражениюВБюджетировании КАК ЗаданияКОтражениюВБюджетировании
		|ГДЕ
		|	ЗаданияКОтражениюВБюджетировании.Документ ССЫЛКА Документ.УдалитьРегистраторГрафикаДвиженияТоваров
		|";
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ЭтоНезависимыйРегистрСведений = Истина;
	ДополнительныеПараметры.ПолноеИмяРегистра = Метаданные.РегистрыСведений.ЗаданияКОтражениюВБюджетировании.ПолноеИмя();
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить(), ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ОбработкаЗавершена = Истина;
	
	МетаданныеРегистра    = Метаданные.РегистрыСведений.ЗаданияКОтражениюВБюджетировании;
	ПолноеИмяРегистра     = МетаданныеРегистра.ПолноеИмя();
	
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьИзмеренияНезависимогоРегистраСведенийДляОбработки(Параметры.Очередь, ПолноеИмяРегистра);
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			Блокировка = Новый БлокировкаДанных;
			
			// Блокировка регистра распределения запасов.
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ЗаданияКОтражениюВБюджетировании");
			ЭлементБлокировки.УстановитьЗначение("Документ", Выборка.Документ);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
			
			Блокировка.Заблокировать();
			
			НаборЗаписей = РегистрыСведений.ЗаданияКОтражениюВБюджетировании.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Документ.Установить(Выборка.Документ, Истина);
			
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() > 0 Тогда
				НаборЗаписей.Очистить();
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей, Истина);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ОбработкаЗавершена = Ложь;
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), Неопределено);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбработкаЗавершена;
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
